"""

Техническое задание.

Написать функцию joint_replacement_system(in_weights):

На вход подается словарь. Ключами являются объекты 3d сцены, за исключением 'paint_weights' и 'skinningMethod'
1 Проводится проверка наличия этих объектов в сцене Заглушка функции проверки - функция is_obj_in_scene Если  все имена
    из словаря присутствуют в сцене то функция возвращает тот же словарь что пришел
    на вход.

2 В противном случае открываться кастомное диалоговое окно.
3 В верхней половине должен размещаться механизм изменения ключей словаря с помощью добавления или 
    вычитания префикса вида "pfx:" 
4 В нижней половине должен отображаться прокручиваемый список отсутствующих в сцене ключей, на против
    которых размещается лайнэдит для ввода ключа вручную и кнопка для добавления имени объекта из сцены
"""